[
    {
        "title": "Payments Under the Table: Evidence from Brazil",
        "coauthor": "Joint with Maximiliano Lauletta and Roberto Hsu Rocha",
        "subtitle": "Funded by Center of Equitable Growth and Center of Effective Global Action (CEGA)",
        "text": "In this paper, we study formal workers receiving part of their salary ''off the books'', which we refer to as ''payments under the table'' (PUT). We conduct the first extensive survey among Brazilian formal workers to understand the extent and mechanics of this type of informality. Despite the widespread belief that third-party reported income exhibits very low evasion, we find that PUT are sizeable and proportionally larger for higher-income workers. Back-of-the-envelope calculations suggest that PUT generate revenue lost from income tax of around 6.8% of total revenues collected by the income tax. Moreover, we show that PUT affects the government budget significantly more than classic informality.  Additionally, we use quasi-experimental variation to shed light on the underlying incentives of employers and employees to engage in collusive tax evasion. First, using the ceiling to the social security contributions in Brazil, we show bunching evidence suggesting that workers closer to retirement exhibit wage reporting patterns consistent with PUT. Bunchers are more likely to be managers and work in smaller firms. Bunchers are also more likely to own a firm that can be used to receive the PUT as a contractor of the firm where they are employees. Finally, we incorporate novel data on labor lawsuits related to PUT to induce variation in employers' incentives to engage in collusive tax evasion. We find a large increase in reported wages for incumbent workers of firms that were sued for PUT, suggesting that employers learn about the risk associated with PUT.    ",
        "link": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4270665",
        "slides": "https://www.dropbox.com/s/b2pml1i7588i989/slides_NTA.pdf?dl=0",
        "img": 1,
        "id": "Papers-One"
    }
]