[

    {
        "title": "How Does Education Shape Entrepreneurship?",
        "coauthor": "Joint with Roberto Hsu and Sebastian Otero",
        "subtitle": "Funded by the Stone Center and the Institute for Research on Labor and Employment",
        "text": "In this paper, we combine novel data on the universe of entrepreneurs between 2010 and 2023 with standarized tests, college application and the census of higher education in Brazil. We first discuss what does it mean to be good entrepreneur, and we develop several measures that allows us to pin down the link between college education and good entrepreneurship. On top of characterizing how different college degrees are correlated with entrepreneurial activity, we estimate causal effects using a regression discontinuity design which exploits the centralized admission system to public universities in Brazil. We adapt the IV VAM to inform policymakers not only whether investment in a specific degree promotes entrepreneurship, but also how these estimates compare across degrees, by holding outside options constant. Third, we test whether the effects on entrepreneurship are associated to social mobility or they are mostly concentrated on students with advantageous socio-economic backgrounds. Finally, we explore the role of peers on explaining the causal estimates, by testing differential slopes in the network's benefits across degrees",
        "id": "Progress-One"
    },

    {
        "title": "Payments Under the Table in Latin America",
        "coauthor":"Joint with Pablo Garriga, Maximiliano Lauletta, Ana Paula Franco, Roberto Hsu, and Nathalie Gonzalez Prieto",
        "subtitle": "Funded by the World Bank",
        "text": "This project extends the work of Feinmann et al (2023) in Brazil to other Latin American countries. We conducted surveys on formal employees in Argentina, Colombia, Chile, and Mexico to learn how common payments under the table are, and what are similitudes and differences across countries. We are in the data collection stage of the project.",
        "id": "Progress-Two"
    },
 
    {
        "title": "Former Coworkers and Startup Performance",
        "coauthor":"Joint with Roberto Hsu",
        "subtitle": "Funded by Institute for Research on Labor and Employment",
        "text": "In this paper, we study whether it is beneficial for startups to hire a known person at the beginning of startups' life. We focus on a particular type of personal connection: workplace connections made by entrepreneurs while they were employees (which we call former coworkers). We create a novel data set from self-collected firm records that track entrepreneurs of all formal businesses in the biggest state of Brazil and match it to matched employer-employee data that covers the universe of formal employment in Brazil. This allows us to building all the necessary pieces for the analysis: tracking entrepreneurs' employment history, creating their network of former coworkers, observing employees in new firms, and tracking their startups' development through time. In order to deal with selection on both entrepreneurs who hire from the networks and former coworkers who accept to work for the entrepreneur, we develope a semi-parametric model where firms decide their set of initial workers from a pool of network and market alternatives, and workers choose whether to join a startup based on their characteristics and employment status. While we answer a very precise question, our theoretical framework is generalizable to all kinds of connections,becoming a contribution in itself.",
        "id": "Progress-Three"
    },

    {
        "title": "The Motherhood Gap in Brazil: The Role of Informal Employment, Entrepreneurship and Maternity Leave",
        "coauthor": "Joint with Daniela Paz and Roberto Hsu",
        "subtitle": "",
        "text": "This projects documents the motherhood gap in formal employment and wages for Brazil by combining data covering about 60% of births and the matched employer-employee from 2003 to 2020. We explore the role of informal employment and self-employment as alternative activities when there is high demand for labor flexbility. Finally, we use a regression discontinuity design on the maternity leave extension to understand how these type of policies affect the motherhood gap and the alternative margin of responses.",
        "id": "Progress-Four"
    },


    {
        "title": "Real and Evasion Responses to Property Taxes: Evidence from Sao Paulo",
        "coauthor": "Joint with Thiago Scot, Roberto Hsu, and Davi Moura ",
        "subtitle": "Funded by Berkeley Opportunity Lab and The World Bank",
        "text": "In this paper, we generate empirical evidence on the real and evasion responses to local property and transaction taxes using granular micro-data from Sao Paulo, the largest city of Brazil. We tackle three main questions: 1) How property taxation/assessments vary across race and gender in a city and what are the drivers of such patterns? 2) What are the consequences of property taxation in terms of labor market, inequality and enterpreneurship? 3) To what extent do we observe tax evasion in property transactions?",
        "id": "Progress-Five"
    }

]